Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFE144.atdf
      <value-group caption="CPU Arbitration Priority to SRAM When Servicing an Interrupt bit(1)" name="CFGCON__CPUPRI">
         <value caption="CPU gets High Priority access to SRAM" name="" value="0x1"/>
         <value caption="CPU uses Least Recently Serviced Arbitration (same as other initiators)" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Read and DMA Write Arbitration Priority to SRAM bit(1)" name="CFGCON__DMAPRI">
         <value caption="DMA gets High Priority access to SRAM" name="" value="0x1"/>
         <value caption="DMA uses Least Recently Serviced Arbitration (same as other initiators)" name="" value="0x0"/>
      </value-group>
      <value-group caption="I/O Analog Charge Pump Enable bit" name="CFGCON__IOANCPEN">
         <value caption="Charge pump is enabled" name="" value="0x80"/>
         <value caption="Charge pump is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA0EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA1EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA2EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA3EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA4EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA5EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA6EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA7EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA8EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA9EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA10EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA11EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA12EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA13EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA14EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA15EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA16EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA17EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA18EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
