Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFE144.atdf
         <register caption="Interrupt Priority Control Registe" name="IPC34" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x00000003" name="DMA2IS"/>
            <bitfield mask="0x0000001C" name="DMA2IP"/>
            <bitfield mask="0x00000300" name="DMA3IS"/>
            <bitfield mask="0x00001C00" name="DMA3IP"/>
            <bitfield mask="0x00030000" name="DMA4IS"/>
            <bitfield mask="0x001C0000" name="DMA4IP"/>
            <bitfield mask="0x03000000" name="DMA5IS"/>
            <bitfield mask="0x1C000000" name="DMA5IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC35" offset="0x370" rw="RW" size="4">
            <bitfield mask="0x00000003" name="DMA6IS"/>
            <bitfield mask="0x0000001C" name="DMA6IP"/>
            <bitfield mask="0x00000300" name="DMA7IS"/>
            <bitfield mask="0x00001C00" name="DMA7IP"/>
            <bitfield mask="0x00030000" name="SPI2EIS"/>
            <bitfield mask="0x001C0000" name="SPI2EIP"/>
            <bitfield mask="0x03000000" name="SPI2RXIS"/>
            <bitfield mask="0x1C000000" name="SPI2RXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC36" offset="0x380" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI2TXIS"/>
            <bitfield mask="0x0000001C" name="SPI2TXIP"/>
            <bitfield mask="0x00000300" name="U2EIS"/>
            <bitfield mask="0x00001C00" name="U2EIP"/>
            <bitfield mask="0x00030000" name="U2RXIS"/>
            <bitfield mask="0x001C0000" name="U2RXIP"/>
            <bitfield mask="0x03000000" name="U2TXIS"/>
            <bitfield mask="0x1C000000" name="U2TXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC37" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C2BIS"/>
            <bitfield mask="0x0000001C" name="I2C2BIP"/>
            <bitfield mask="0x00000300" name="I2C2SIS"/>
            <bitfield mask="0x00001C00" name="I2C2SIP"/>
            <bitfield mask="0x00030000" name="I2C2MIS"/>
            <bitfield mask="0x001C0000" name="I2C2MIP"/>
            <bitfield mask="0x03000000" name="CAN1IS"/>
            <bitfield mask="0x1C000000" name="CAN1IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC38" offset="0x3a0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CAN2IS"/>
            <bitfield mask="0x0000001C" name="CAN2IP"/>
            <bitfield mask="0x00000300" name="ETHIS"/>
            <bitfield mask="0x00001C00" name="ETHIP"/>
            <bitfield mask="0x00030000" name="SPI3EIS"/>
            <bitfield mask="0x001C0000" name="SPI3EIP"/>
            <bitfield mask="0x03000000" name="SPI3RXIS"/>
            <bitfield mask="0x1C000000" name="SPI3RXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC39" offset="0x3b0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI3TXIS"/>
            <bitfield mask="0x0000001C" name="SPI3TXIP"/>
            <bitfield mask="0x00000300" name="U3EIS"/>
            <bitfield mask="0x00001C00" name="U3EIP"/>
            <bitfield mask="0x00030000" name="U3RXIS"/>
            <bitfield mask="0x001C0000" name="U3RXIP"/>
            <bitfield mask="0x03000000" name="U3TXIS"/>
            <bitfield mask="0x1C000000" name="U3TXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC40" offset="0x3c0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C3BIS"/>
            <bitfield mask="0x0000001C" name="I2C3BIP"/>
            <bitfield mask="0x00000300" name="I2C3SIS"/>
            <bitfield mask="0x00001C00" name="I2C3SIP"/>
            <bitfield mask="0x00030000" name="I2C3MIS"/>
            <bitfield mask="0x001C0000" name="I2C3MIP"/>
            <bitfield mask="0x03000000" name="SPI4EIS"/>
            <bitfield mask="0x1C000000" name="SPI4EIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC41" offset="0x3d0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI4RXIS"/>
            <bitfield mask="0x0000001C" name="SPI4RXIP"/>
            <bitfield mask="0x00000300" name="SPI4TXIS"/>
            <bitfield mask="0x00001C00" name="SPI4TXIP"/>
            <bitfield mask="0x00030000" name="RTCCIS"/>
            <bitfield mask="0x001C0000" name="RTCCIP"/>
            <bitfield mask="0x03000000" name="FCEIS"/>
            <bitfield mask="0x1C000000" name="FCEIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC42" offset="0x3e0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PREIS"/>
            <bitfield mask="0x0000001C" name="PREIP"/>
            <bitfield mask="0x00000300" name="SQI1IS"/>
            <bitfield mask="0x00001C00" name="SQI1IP"/>
            <bitfield mask="0x00030000" name="U4EIS"/>
            <bitfield mask="0x001C0000" name="U4EIP"/>
            <bitfield mask="0x03000000" name="U4RXIS"/>
            <bitfield mask="0x1C000000" name="U4RXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC43" offset="0x3f0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U4TXIS"/>
            <bitfield mask="0x0000001C" name="U4TXIP"/>
            <bitfield mask="0x00000300" name="I2C4BIS"/>
            <bitfield mask="0x00001C00" name="I2C4BIP"/>
            <bitfield mask="0x00030000" name="I2C4SIS"/>
            <bitfield mask="0x001C0000" name="I2C4SIP"/>
            <bitfield mask="0x03000000" name="I2C4MIS"/>
            <bitfield mask="0x1C000000" name="I2C4MIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC44" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI5EIS"/>
            <bitfield mask="0x0000001C" name="SPI5EIP"/>
            <bitfield mask="0x00000300" name="SPI5RXIS"/>
            <bitfield mask="0x00001C00" name="SPI5RXIP"/>
            <bitfield mask="0x00030000" name="SPI5TXIS"/>
            <bitfield mask="0x001C0000" name="SPI5TXIP"/>
            <bitfield mask="0x03000000" name="U5EIS"/>
            <bitfield mask="0x1C000000" name="U5EIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC45" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U5RXIS"/>
            <bitfield mask="0x0000001C" name="U5RXIP"/>
            <bitfield mask="0x00000300" name="U5TXIS"/>
            <bitfield mask="0x00001C00" name="U5TXIP"/>
            <bitfield mask="0x00030000" name="I2C5BIS"/>
            <bitfield mask="0x001C0000" name="I2C5BIP"/>
            <bitfield mask="0x03000000" name="I2C5SIS"/>
            <bitfield mask="0x1C000000" name="I2C5SIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC46" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C5MIS"/>
            <bitfield mask="0x0000001C" name="I2C5MIP"/>
            <bitfield mask="0x00000300" name="SPI6EIS"/>
            <bitfield mask="0x00001C00" name="SPI6EIP"/>
            <bitfield mask="0x00030000" name="SPI6RXIS"/>
            <bitfield mask="0x001C0000" name="SPI6RXIP"/>
            <bitfield mask="0x03000000" name="SPI6TXIS"/>
            <bitfield mask="0x1C000000" name="SPI6TXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC47" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U6EIS"/>
            <bitfield mask="0x0000001C" name="U6EIP"/>
            <bitfield mask="0x00000300" name="U6RXIS"/>
            <bitfield mask="0x00001C00" name="U6RXIP"/>
            <bitfield mask="0x00030000" name="U6TXIS"/>
            <bitfield mask="0x001C0000" name="U6TXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC48" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCEOSIS"/>
            <bitfield mask="0x0000001C" name="ADCEOSIP"/>
            <bitfield mask="0x00000300" name="ADCARDYIS"/>
            <bitfield mask="0x00001C00" name="ADCARDYIP"/>
            <bitfield mask="0x00030000" name="ADCURDYIS"/>
            <bitfield mask="0x001C0000" name="ADCURDYIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC49" offset="0x450" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCGRPIS"/>
            <bitfield mask="0x0000001C" name="ADCGRPIP"/>
            <bitfield mask="0x00030000" name="ADC0EIS"/>
            <bitfield mask="0x001C0000" name="ADC0EIP"/>
            <bitfield mask="0x03000000" name="ADC1EIS"/>
            <bitfield mask="0x1C000000" name="ADC1EIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC50" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADC2EIS"/>
            <bitfield mask="0x0000001C" name="ADC2EIP"/>
            <bitfield mask="0x00000300" name="ADC3EIS"/>
            <bitfield mask="0x00001C00" name="ADC3EIP"/>
            <bitfield mask="0x00030000" name="ADC4EIS"/>
            <bitfield mask="0x001C0000" name="ADC4EIP"/>
         </register>
