Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFE144.atdf
         <register caption="System Bus Target 'x' Error Control Register" name="SBT0ECON" offset="0x7b18" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT0ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT1ECON" offset="0x7f18" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT1ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT2ECON" offset="0x8318" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT2ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT3ECON" offset="0x8718" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT3ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT4ECON" offset="0x8b18" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT4ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT5ECON" offset="0x8f18" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT5ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT6ECON" offset="0x9318" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT6ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT7ECON" offset="0x9718" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT7ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT8ECON" offset="0x9b18" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT8ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT9ECON" offset="0x9f18" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT9ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT10ECON" offset="0xa318" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT10ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT11ECON" offset="0xa718" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT11ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT12ECON" offset="0xab18" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT12ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT13ECON" offset="0xaf18" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT13ECON__ERRP"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT0ECLRS" offset="0x7b20" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT1ECLRS" offset="0x7f20" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT2ECLRS" offset="0x8320" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT3ECLRS" offset="0x8720" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT4ECLRS" offset="0x8b20" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT5ECLRS" offset="0x8f20" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT6ECLRS" offset="0x9320" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT7ECLRS" offset="0x9720" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT8ECLRS" offset="0x9b20" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT9ECLRS" offset="0x9f20" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT10ECLRS" offset="0xa320" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT11ECLRS" offset="0xa720" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT12ECLRS" offset="0xab20" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
